package Day05;

public class Day05_1 {//c s
	public static void main(String[] args) {//m s
		
		
		
		// 반복문 [ 조건에 따른 반복실행 ]
			// for, while, do~while
			// 1. for :  어디서부터 어디까지 어떻게 증가하면서 반복실행
				// for( 초기값, 조건문, 증감식 ){ 실행문 };
			
			// 2. for 중첩
				// for1(){ for2(){ for3(){}}}
					// 총 실행 횟수 랙
			
			
			
			
			// 예1)
			for( int i = 0 ; i<10 ; i++ ) {//for s
				// 1. 초기값( int i = 0 ) : for 시작변수의 값
							// 2. 조건문( i<10 ) : True이면 반복문 실행 아니면(false) 실행X
							// 3. 증감식( i++ // i = i+1 // i+=1 ) : 변수의 증감단위
					
				System.out.println(i+" ");
				// i = 0 일때 조건 : T 반복실행 O
				// 증감식[i+1] i=1 일떄 조건 : t 반복실행 O
				// 증감식[i+1] i=2 일떄 조건 : t 반복실행 O
				//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
				// 증감식[i+1] i=10 일떄 조건 : f 반복 종료
				}//for e
			
			System.out.println("\n-----------------------------------------------");
			// 예2 ) 1~50까지 출력	
			for( int ii = 1 ; ii<=50 ; ii++ ) {System.out.print(ii+" ");}
			System.out.println("\n-----------------------------------------------");
			
			// 예3 ) 1~50까지 3씩 증가
			for( int iii = 1 ; iii<=50 ; iii+=3 ) {System.out.print(iii+" ");}
			System.out.println("\n-----------------------------------------------");
			
			// 예4 ) 1~50까지 누적합계
			int 누적합계 = 0;// 누적값을 저장할 변수
			for( int i4 = 1 ; i4<=50 ; i4++ ) { 누적합계 += i4 ;}
			System.out.print("1~50까지 누적합계 : " + 누적합계);
			System.out.println("\n-----------------------------------------------");
			
			// 예5 ) 1~50까지 7배수의 누적합계
			int 누적합계2 = 0;// 누적값을 저장할 변수
			for( int i5 = 1 ; i5<=50 ; i5+=7 ) { 누적합계2 += i5 ;}
			System.out.print("1~50까지 7배수의 누적합계 : " + 누적합계2);
			///////////////////////////////////////////////
			System.out.println("\n-----------------------------------------------");
			
			int 누적합계3 = 0;
			for( int i6= 1 ; i6<=50 ; i6++ ) { if( i6%7==0 ) 누적합계3 += i6;}
			System.out.print("1~50까지 7배수의 누적합계2 : " + 누적합계3);
			System.out.println("\n-----------------------------------------------");
			
			// 예6 : 2단 구구단 [ 2단:상수    곱:변수 ]
			for( int 곱 = 1 ; 곱<=9 ; 곱++ ) { 
			System.out.println("2 X " + 곱 + " = " + (2*곱) );}
			
			System.out.println("\n-----------------------------------------------");
			
			
			
			// 예7 : 2~15단까지 구구단
			for( int 곱3 = 1 ; 곱3<=9 ; 곱3++ ) { 
				System.out.println("3 X " + 곱3 + " = " + (3*곱3) );}
			
			System.out.println("\n-----------------------------------------------");
			
			for( int 곱4 = 1 ; 곱4<=9 ; 곱4++ ) { 
				System.out.println("4 X " + 곱4 + " = " + (4*곱4) );}
			
			System.out.println("\n-----------------------------------------------");
			
			// for 중첩 사용
			for( int i중첩 = 0 ; i중첩<=5 ; i중첩++) {
				System.out.println(" i중첩의 위치 : " + i중첩 );
				for( int j중첩 = 0 ; j중첩<=5 ; j중첩++ ) {
					System.out.println("--- j중첩의 위치 : " + j중첩 + "그리고 현재 i중첩 : " + i중첩);
				}
			}
			
			System.out.println("\n-----------------------------------------------");
			
			// 예7 : 2~15단까지 구구단 중첩사용
				// 단 : 2~15까지 1씩 증가하면서 반복
					// 곱은 단마다 1~9까지 1씩 증가하면서 반복
			for( int 단= 2 ; 단<=15; 단++ ) {
				System.out.println("----"+ 단 + "단 결과");
				for( int 곱 = 1 ; 곱<=9; 곱++) {System.out.println(단+" X " + 곱 +" = " + (단*곱));}
			}
			
			
			
			
			
			
			
			
		}//m e
}//c e
